Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.InnerFillet
Inner Fillet - Corner fillet inner radius.
Since:
2016

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallDesignThickness
Represents wall design thickness of rectangle.
Remarks:
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
Since:
2016

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallNominalThickness
Represents wall nominal thickness of rectangle.
Remarks:
Nominal is measured real value of profile, should be thicker than designed.
Since:
2016

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
Defines parameters for Hot Formed structural section.
Since:
2016